# Apply(), map() and applymap()

### Import de Bibliotecas

In [1]:
import pandas as pd

In [13]:
sales = pd.read_csv('../Course_Materials_Part1/Video_Lecture_NBs/sales.csv', index_col=0)

In [14]:
sales

        Mon  Tue  Wed   Thu  Fri
Steven   34   27   15   NaN   33
Mike     45    9   74  87.0   12
Andi     17   33   54   8.0   29
Paul     87   67   27  45.0    7

In [15]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, Steven to Paul
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Mon     4 non-null      int64
 1   Tue     4 non-null      int64
 2   Wed     4 non-null      int64
 3   Thu     3 non-null      float64
 4   Fri     4 non-null      int64
dtypes: float64(1), int64(4)
memory usage: 192.0+ bytes

#### Calculo dos valores mínimos pra cada coluna

In [21]:
sales.min(axis=0)

Mon    17.0
Tue     9.0
Wed    15.0
Thu     8.0
Fri     7.0
dtype: float64

In [17]:
sales.max(axis=0)

Mon    87.0
Tue    67.0
Wed    74.0
Thu    87.0
Fri    33.0
dtype: float64

#### Calculo dos valores mínimos pra cada linha

In [18]:
sales.min(axis=1)

Steven    15.0
Mike       9.0
Andi       8.0
Paul       7.0
dtype: float64

In [19]:
sales.max(axis=1)

Steven    34.0
Mike      87.0
Andi      54.0
Paul      87.0
dtype: float64

#### Definir uma função que calcula o range entre o maior e menor valor de uma linha ou uma coluna(dependendo do axis)

In [24]:
def range(series):
    return series.max() - series.min()

#### apply() aplica uma função em uma linha ou uma coluna

In [26]:
sales.apply(range, axis=0)

Mon    70.0
Tue    58.0
Wed    59.0
Thu    79.0
Fri    26.0
dtype: float64

In [30]:
sales.apply(lambda x: x.max() - x.min(), axis = 0)

Mon    70.0
Tue    58.0
Wed    59.0
Thu    79.0
Fri    26.0
dtype: float64

In [31]:
summer = pd.read_csv('../Course_Materials_Part1/Video_Lecture_NBs/summer.csv')

In [32]:
summer.head()

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
0,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100M Freestyle,Gold
1,1896,Athens,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100M Freestyle,Silver
2,1896,Athens,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100M Freestyle For Sailors,Bronze
3,1896,Athens,Aquatics,Swimming,"MALOKINIS, Ioannis",GRE,Men,100M Freestyle For Sailors,Gold
4,1896,Athens,Aquatics,Swimming,"CHASAPIS, Spiridon",GRE,Men,100M Freestyle For Sailors,Silver

In [34]:
summer.Athlete.apply(lambda x: x[0])

0        H
1        H
2        D
3        M
4        C
        ..
31160    J
31161    R
31162    T
31163    A
31164    L
Name: Athlete, Length: 31165, dtype: object

In [36]:
summer.Athlete.map(lambda x: x[0:3])

0        HAJ
1        HER
2        DRI
3        MAL
4        CHA
        ...
31160    JAN
31161    REZ
31162    TOT
31163    ALE
31164    LID
Name: Athlete, Length: 31165, dtype: object

In [39]:
summer.iloc[:, 1:4].applymap(lambda x: x[0:2])

      City Sport Discipline
0       At    Aq         Sw
1       At    Aq         Sw
2       At    Aq         Sw
3       At    Aq         Sw
4       At    Aq         Sw
...    ...   ...        ...
31160   Lo    Wr         Wr
31161   Lo    Wr         Wr
31162   Lo    Wr         Wr
31163   Lo    Wr         Wr
31164   Lo    Wr         Wr

[31165 rows x 3 columns]

#### Aplicando 40% em cada célula do DF e subtraindo uma constante de 5 do valor resultante

In [41]:
sales.applymap(lambda x: 0.4*x-5)

         Mon   Tue   Wed   Thu  Fri
Steven   8.6   5.8   1.0   NaN  8.2
Mike    13.0  -1.4  24.6  29.8 -0.2
Andi     1.8   8.2  16.6  -1.8  6.6
Paul    29.8  21.8   5.8  13.0 -2.2